# **Pivot Tables in Pandas**

In [2]:
import pandas as pd
import numpy as np


---


## **Table of Contents**

1. **Introduction to Pivot Tables**
2. **Pivot Table Syntax**
3. **Creating Pivot Tables**
   - Aggregating Data in Pivot Tables
   - Handling Missing Data
4. **Advanced Pivot Table Features**
   - Multiple Aggregations
   - Custom Aggregation Functions
   - Margins (Grand Totals)
5. **Practical Examples and Use Cases**
6. **Differences Between `pivot_table()` and `groupby()`**

---


## **1. Introduction to Pivot Tables**


A **pivot table** is a powerful tool for summarizing and analyzing data. It allows you to reorganize and aggregate data based on specific columns, making it easier to extract insights.

In Pandas, the `pivot_table()` function is used to create pivot tables.

---


## **2. Pivot Table Syntax**

```python
pd.pivot_table(
    data,               # DataFrame
    values=None,        # Column(s) to aggregate
    index=None,         # Column(s) to group by (rows)
    columns=None,       # Column(s) to group by (columns)
    aggfunc='mean',    # Aggregation function (default: mean)
    fill_value=None,   # Value to replace missing values
    margins=False,     # Add row/column totals (default: False)
    margins_name='All' # Name for the margins row/column
)
```
---


## **3. Creating Pivot Tables**

In [3]:
# Sample DataFrame
data = {
    "Category": ["A", "B", "A", "B", "A", "B"],
    "Subcategory": ["X", "X", "Y", "Y", "X", "Y"],
    "Values": [20, 80, 10, 30, 50, 70],
}

df = pd.DataFrame(data)
df

  Category Subcategory  Values
0        A           X      20
1        B           X      80
2        A           Y      10
3        B           Y      30
4        A           X      50
5        B           Y      70

---


### **3.1 Aggregating Data in Pivot Tables**

By default, `pivot_table()` uses the **`mean`** aggregation function. You can specify a different aggregation function using the `aggfunc` parameter.

In [4]:
# Create a pivot table
df.pivot_table(
    index="Category",
    values="Values",
    aggfunc="mean",
)

             Values
Category
A         26.666667
B         60.000000

In [5]:
# Pivot table with sum aggregation
df.pivot_table(
    index="Category",
    columns="Subcategory",
    values="Values",
    aggfunc="sum",
)

Subcategory   X    Y
Category
A            70   10
B            80  100


---


### **3.2 Handling Missing Data**

In [6]:
# Sample DataFrame with missing values
data = {
    "Category": ["A", "B", "A", "B", "A", "B"],
    "Subcategory": ["X", "X", "Y", "Y", "X", "Y"],
    "Values": [10, 20, None, 40, 50, np.nan],
}

df = pd.DataFrame(data)
df

  Category Subcategory  Values
0        A           X    10.0
1        B           X    20.0
2        A           Y     NaN
3        B           Y    40.0
4        A           X    50.0
5        B           Y     NaN

In [7]:
# Pivot table with missing values filled
pivot_filled = df.pivot_table(
    index="Category",
    columns="Subcategory",
    values="Values",
    fill_value=0,
)

print("Pivot Table (Filled Missing Values):")
pivot_filled

Pivot Table (Filled Missing Values):

Subcategory     X     Y
Category
A            30.0   0.0
B            20.0  40.0


---


## **4. Advanced Pivot Table Features**

In [8]:
# Sample DataFrame
data = {
    "Category": ["A", "B", "A", "B", "A", "B"],
    "Subcategory": ["X", "X", "Y", "Y", "X", "Y"],
    "Values": [20, 80, 10, 30, 50, 70],
}

df = pd.DataFrame(data)
df

  Category Subcategory  Values
0        A           X      20
1        B           X      80
2        A           Y      10
3        B           Y      30
4        A           X      50
5        B           Y      70

---


### **4.1 Multiple Aggregations**

In [9]:
# Pivot table with multiple aggregations
pivot_multi = df.pivot_table(
    index="Category",
    columns="Subcategory",
    values="Values",
    aggfunc=["sum", "mean"],
)

print("Pivot Table (Multiple Aggregations):")
pivot_multi

Pivot Table (Multiple Aggregations):

            sum       mean
Subcategory   X    Y     X     Y
Category
A            70   10  35.0  10.0
B            80  100  80.0  50.0


---


### **4.2 Custom Aggregation Functions**

In [10]:
# Custom aggregation function
def range_of_values(x):
    return x.max() - x.min()

In [11]:
# Pivot table with custom aggregation
pivot_custom = df.pivot_table(
    index="Category",
    columns="Subcategory",
    values="Values",
    aggfunc=["max", "min", range_of_values],
)

print("Pivot Table (Custom Aggregation):")
pivot_custom

Pivot Table (Custom Aggregation):

            max     min     range_of_values
Subcategory   X   Y   X   Y               X   Y
Category
A            50  10  20  10              30   0
B            80  70  80  30               0  40


---


### **4.3 Margins (Grand Totals)**

Add **margins** to include row and column totals in the pivot table.

In [12]:
# Pivot table with margins
pivot_margins = df.pivot_table(
    index="Category",
    columns="Subcategory",
    values="Values",
    aggfunc="sum",
    margins=True,
    margins_name="Total",
)
print("Pivot Table (With Margins):")
pivot_margins

Pivot Table (With Margins):

Subcategory    X    Y  Total
Category
A             70   10     80
B             80  100    180
Total        150  110    260


---


## **5. Practical Examples and Use Cases**


### **5.1 Sales Data Analysis**

In [21]:
# Sample Sales Data
sales_data = {
    "Region": ["North", "South", "North", "North", "South", "South"],
    "Product": ["A", "A", "B", "A", "B", "A"],
    "Sales": [100, 200, 150, 250, 300, 350],
}

df_sales = pd.DataFrame(sales_data)
print("Sales Data:")
df_sales

Sales Data:

  Region Product  Sales
0  North       A    100
1  South       A    200
2  North       B    150
3  North       A    250
4  South       B    300
5  South       A    350

In [23]:
# Pivot table: Total sales by region and product
pivot_sales = df_sales.pivot_table(
    index="Region",
    columns="Product",
    values="Sales",
    aggfunc=["sum", "mean"],
)

print("Sales Pivot Table:")
pivot_sales

Sales Pivot Table:

         sum        mean
Product    A    B      A      B
Region
North    350  150  175.0  150.0
South    550  300  275.0  300.0


---


### **5.2 Employee Data Analysis**

In [15]:
# Sample Employee Data
employee_data = {
    "Department": ["HR", "IT", "HR", "IT", "Finance", "Finance"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "Salary": [50000, 60000, 55000, 70000, 80000, 75000],
}

df_employee = pd.DataFrame(employee_data)
print("Employee Data:")
df_employee

Employee Data:

  Department Employee  Salary
0         HR    Alice   50000
1         IT      Bob   60000
2         HR  Charlie   55000
3         IT    David   70000
4    Finance      Eve   80000
5    Finance    Frank   75000

In [26]:
# Pivot table: Average salary by department
pivot_employee = df_employee.pivot_table(
    index="Department",
    values="Salary",
    aggfunc=["min", "mean", "max"],
)

print("Employee Pivot Table:")
pivot_employee

Employee Pivot Table:

              min     mean    max
           Salary   Salary Salary
Department
Finance     75000  77500.0  80000
HR          50000  52500.0  55000
IT          60000  65000.0  70000


---


## **6. Differences Between `pivot_table()` and `groupby()`**

| Feature                | `pivot_table()`                              | `groupby()`                                  |
|------------------------|----------------------------------------------|---------------------------------------------|
| **Purpose**            | Summarize and reorganize data in a tabular format | Group data and apply aggregations           |
| **Output**             | Returns a DataFrame with a multi-level index | Returns a GroupBy object                   |
| **Ease of Use**        | Easier for creating summary tables           | More flexible for complex operations        |
| **Aggregation**        | Built-in support for multiple aggregations   | Requires explicit aggregation functions     |
| **Margins**            | Supports row and column totals               | Does not support margins                    |

---


## **Summary Table**

| Feature                | Description                                                                 |
|------------------------|-----------------------------------------------------------------------------|
| **Basic Pivot Table**  | Summarize data by one or more columns                                       |
| **Aggregations**       | Apply built-in or custom aggregation functions                              |
| **Handling Missing Data** | Fill missing values with `fill_value`                                     |
| **Multiple Aggregations** | Apply multiple aggregation functions simultaneously                        |
| **Margins**            | Add row and column totals to the pivot table                                |

---